EDT/УТ/src/DataProcessors/УстановкаСтатусовУтериЗаказов/УстановкаСтатусовУтериЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УстановкаСтатусовУтериЗаказов</name>
  <attributes>
    <name>Статус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалОбработки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

EDT/УТ/src/Documents/ГрупповаяУстановкаСтатусовЗаказов/ГрупповаяУстановкаСтатусовЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ГрупповаяУстановкаСтатусовЗаказов</name>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалОбработки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийОператорМаршрутизации</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтатусыЗаказов</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>CatalogRef.СтатусыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>Рейс</name>
      <type>
        <types>DocumentRef.Рейс</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Catalogs/СтатусыЗаказов/СтатусыЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатусыЗаказов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>RED</name>
      <description>RED</description>
    </items>
    <items>
      <name>ВОбработке</name>
      <description>В обработке</description>
      </content>
      </content>
    </items>
    <items>
      <name>Выполнен_</name>
      <description>Выполнен</description>
    </items>
    <items>
      <name>Новый</name>
      <description>Новый</description>
    </items>
    <items>
      <name>Отклонен</name>
      <description>Отклонен</description>
    </items>
  </predefined>
  <attributes>
    <name>Статус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСтатуса</name>
    <type>
      <types>EnumRef.ТипыСтатусов</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/DataProcessors/УстановкаСтатусовУтериЗаказов/Forms/Форма/Module.bsl
&НаСервере
Процедура ЗаказПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НомерЗаказа", Формат(Объект.НомерЗаказа, "ЧГ="));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Заказ,
	|	РеализацияТоваровУслуг.ТерминалПриема КАК ТерминалОбработки
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Номер = &НомерЗаказа";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Объект.Заказ = Неопределено;
		Объект.ТерминалОбработки = Неопределено;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(Объект, Выборка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПриИзменении(Элемент)
	
	Если Объект.НомерЗаказа Тогда
		ЗаказПриИзмененииНаСервере();
	Иначе
		Объект.Заказ = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусНаСервере()
	
	ТерминалОбработки = Объект.ТерминалОбработки;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заказ", Объект.Заказ);
	Запрос.УстановитьПараметр("ТерминалОбработки", Объект.ТерминалОбработки);
	Запрос.УстановитьПараметр("КодСтатуса", Объект.Статус);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &ТерминалОбработки <> ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.ПустаяСсылка)
	|			ТОГДА &ТерминалОбработки
	|		ИНАЧЕ РеализацияТоваровУслуг.ТерминалПриема
	|	КОНЕЦ КАК ТерминалОбработки,
	|	СтатусыЗаказов.Ссылка КАК Статус
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтатусыЗаказов КАК СтатусыЗаказов
	|		ПО (СтатусыЗаказов.Код = &КодСтатуса)
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Заказ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Сейчас = ТекущаяДата();
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Док = Документы.ГрупповаяУстановкаСтатусовЗаказов.СоздатьДокумент();
	Док.Дата = Сейчас;
	Док.УстановитьНовыйНомер();
	Док.Ответственный = ТекПользователь;
	Док.ТерминалОбработки = Выборка.ТерминалОбработки;
	//Док.ВнешнийОператорМаршрутизации = ВнешнийОператорМаршрутизации;
	Док.Статус = Выборка.Статус;
	
	СтрокаСтатуса = Док.СтатусыЗаказов.Добавить();
	СтрокаСтатуса.Заказ = Объект.Заказ;
	СтрокаСтатуса.Статус = Выборка.Статус;
	
	Док.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьСтатус(Команда)
	
	Если Не Объект.Заказ.Пустая() И Объект.Статус Тогда
		УстановитьСтатусНаСервере();
		ПоказатьПредупреждение(, "Статус установлен");
	Иначе
		ПоказатьПредупреждение(, "Укажите заказ и его статус");
	КонецЕсли;
	
КонецПроцедуры
